Revit 2026 API

# EnergyAnalysisOpeningWidth Property

---

The width of the analytical rectangular geometry.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Width { get; }
```
```vb
Public ReadOnly Property Width As Double
	Get
```
```cpp
public:
property double Width {
	double get ();
}
```
```fsharp
member Width : float with get
```

#### Property Value

Double

The product of width and height should be equal to the area of the polyloop for the opening. The width is adjusted to accomplish this.

#### Reference

EnergyAnalysisOpening Class

Autodesk.Revit.DB.Analysis Namespace